---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailureDefinitionRegistry
source: html/333c25e1-778e-761b-b4f5-f9ac0376b01d.htm
---
# FailureDefinitionRegistry Methods

Finds a specific FailureDefinition by a given FailureDefinitionId.